-- Заповнення таблиці 'vehicle' даними
INSERT INTO vehicle (number, Machinery, Count, fuel, Manpower, num_rota, BK) VALUES 
(196730547, 'БМП-2', 1, 600, 3, 1, '500:2000:1:4'),
(748292438, 'БМП-3', 1, 600, 3, 1, '40:3000:8'),
(983757635, 'БМП-2', 1, 600, 3, 1, '500:2000:1:4'),
(465327856, 'БМП-2', 1, 600, 3, 1, '500:2000:1:4'),
(923847609, 'БМП-3', 1, 600, 3, 1, '40:3000:8'),
(546378901, 'БМП-2', 1, 600, 3, 1, '500:2000:1:4'),
(127563798, 'БМП-2', 1, 600, 3, 1, '500:2000:1:4'),
(348556743, 'БМП-3', 1, 600, 3, 1, '40:3000:8'),
(432985665, 'БМП-3', 1, 600, 3, 1, '500:3000:8'),
(765434567, 'БМП-3', 1, 600, 3, 1, '500:3000:8'),
(439875578, 'Т-64БВ', 1, 1000, 3, 1, '36:1000:1000'),
(425347567, 'Т-64БВ', 1, 1000, 3, 1, '36:1000:1000'),
(365437568, 'Т-64БВ', 1, 1000, 3, 1, '36:1000:1000'),
(346568768, 'Т-64БВ', 1, 1000, 3, 1, '36:1000:1000');


-- Заповнення таблиці 'ITO' даними
INSERT INTO ITO (id, classification, num_rota, name, count) VALUES 
(1, 'Інженерне приладдя', 1, 'Лопата штикова', 100),
(2, 'Інженерне приладдя', 1, 'Лом', 20),
(3, 'Розхідний матеріал', 1, 'Дошки бліндажні', 150),
(4, 'Інженерне приладдя', 2, 'Лопата штикова', 100),
(5, 'Інженерне приладдя', 2, 'Лом', 20),
(6, 'Розхідний матеріал', 2, 'Дошки бліндажні', 200),
(7, 'Інженерне приладдя', 3, 'Лопата штикова', 100),
(8, 'Інженерне приладдя', 3, 'Лом', 20),
(9, 'Розхідний матеріал', 3, 'Дошки бліндажні', 170),
(10, 'Інженерне приладдя', 3, 'Бліндаж модульний', 2);

-- Заповнення таблиці 'electro' даними
INSERT INTO electro (id, serial_number, num_rota, name, count) VALUES 
(1, NULL, 1, 'рація motorola', 20),
(2, NULL, 1, 'haris', 10),
(3, 967959315, 1, 'p-1150', 1),
(4, NULL, 2, 'dp - 4400', 30),
(5, NULL, 3, 'dp - 4400', 32),
(6, NULL, 1, 'fpv дрон', 10);

-- Заповнення таблиці 'food' даними
INSERT INTO food (id, name, count, num_rota) VALUES 
(1, 'Сухий пайок', '100 шт', 1),
(2, 'тушонка свинина', '100 шт', 1),
(3, 'картопля', '100 кг', 1),
(4, 'Сухий пайок', '200 шт', 2),
(5, 'Вода питна 1.5 л', '200 шт', 1);

INSERT INTO Persons (id, FIO, size_clothes, size_shoes, serial_num, name_weapon, num_rota, rank) VALUES 
(43756634, 'Петренко Г.В.', 82, 43, 861807332, 'АК-74', 1, 'Сержант'),
(43756435, 'Гаврилюк О.С.', 86, 42, 493142472, 'АК-74', 1, 'Солдат'),
(86576634, 'Глушко І.С.', 74, 41, 727739319, 'АК-74', 1, 'Солдат'),
(85466634, 'Стерненко А.В.', 80, 42, 738397875, 'АК-74', 1, 'Солдат'),
(43827568, 'Ластовий А.В.', 82, 44, 753895299, 'АК-74', 1, 'Солдат'),
(85698712, 'Умеров В.С.', 86, 45, 896991618, 'АК-74', 1, 'Солдат'),
(57672146, 'Петров О.Г.', 76, 41, 769585862, 'АК-74', 1, 'Солдат'),
(74893276, 'Лопата П.К.', 78, 41, 753499168, 'АК-74', 1, 'Солдат'),
(29834756, 'Попов К.П.', 78, 42, 941358987, 'АК-74', 1, 'Солдат'),
(87564986, 'Кнопка Т.А.', 78, 43, 818927746, 'АК-74', 1, 'Солдат'),
(32786823, 'Скупля П.П.', 78, 42, 402245698, 'АК-74', 1, 'Солдат'),
(43798569, 'Курмаш В.А.', 82, 44, 595338391, 'АК-74', 1, 'Солдат'),
(43875684, 'Табуретка П.В.', 82, 42, 985500431, 'АК-74', 1, 'Солдат'),
(72834129, 'Уймін В.О.', 80, 42, 215176270, 'АК-74', 1, 'Солдат');
